"A dataset can be unimodal (one mode), bimodal (two modes), trimodal (three modes), or multimodal (multiple modes)."
"For an odd number of observations, the median is the value at the (n+1)/2 position in the ordered list."
"Arithmetic Series Formula: Sum of n terms = n/2*(first term + last term)"
"The sum of squares is commutative: a² + b² = b² + a²"
"Lagrange's four-square theorem: Every natural number can be represented as the sum of four integer squares"
"A sum of squares cannot be factored into real polynomials unless individual squares are factored separately"
"Associative Property: (a + b) + c = a + (b + c)"
"Monotonicity: If a > b, then a + c > b + c for real numbers"
"The median is a measure of central tendency that is resistant to outliers."
"The sum of the squares of the first n natural numbers is n(n+1)(2n+1)/6"
"The mode is not influenced by extreme values or outliers."
"Sum of Consecutive Integers: 1 + 2 + ... + n = n(n + 1)/2"
"Commutative Property: a + b = b + a"
"The mode is one of the three common measures of central tendency, alongside the mean and median."
"In a right-angled triangle, the sum of the squares of the legs equals the square of the hypotenuse (Pythagorean theorem)"
"Summation Notation: Σ (sigma) represents the sum of a sequence"
"The quadratic mean (root mean square) is always greater than or equal to the arithmetic mean"
"The median splits the dataset into two equal halves, with half the values less than or equal to it and half greater than or equal to it."
"The median is the middle value in an ordered list of numerical data."
"The median does not depend on the actual numerical values, only their order in the dataset."
"Cauchy-Schwarz inequality: (Σa_i*b_i)² ≤ (Σa_i²)(Σb_i²)"
"In a histogram, the mode corresponds to the bin(s) with the highest frequency."
"A dataset where all values occur with the same frequency has no mode."
"The median is uniquely determined for a given dataset, even if there are duplicate values."
"The sum of squares is always non-negative since squares are non-negative"
"The mode can be applied to both qualitative (categorical) and quantitative data."
"The median minimizes the sum of absolute deviations from it among all possible values."
"The L2 norm of a vector is the square root of the sum of the squares of its components"
"The variance of a dataset is calculated using the sum of squared deviations from the mean"
"For an even number of observations, the median is the average of the values at the n/2 and (n/2 + 1) positions in the ordered list."
"The mode is the value that appears most frequently in a dataset."
"Inverse Element: a + (-a) = 0"
"Additive Cancellation: If a + b = a + c, then b = c"
"Distributive Property: a(b + c) = ab + ac"
"Identity Element: a + 0 = a"
